#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1e88ab2c-70c0-4d4a-92f7-e65edaa3da92]
module.keycloak_test.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8f854209-7836-41ac-9437-abada1f8f71c]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a838734a-1076-4eb0-9f35-760902db084c]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=678be901-5038-4ab6-abcd-1c45e7271a59]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=041468e5-714d-4066-84ee-2f523dd6cf4c]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0bb0d5d4-88cf-44eb-95a1-6374bfd66eb8]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=96f3ec27-753f-4073-863c-965f466273d0]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=21a1be6a-5d21-41ea-86fd-704aaa487eca]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f10ace47-b3ea-485c-b6a7-0ef95845410f]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b6bd4801-b04b-42e0-ba2d-18d750d6bb69]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=33bed14b-153b-4055-ae51-bda03e8fb4e1]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7db8c7bb-15c6-4b36-9448-8751e7cb21ae]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a1cf4b9f-7438-4618-a000-b3bea685c3f3]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=917d503e-0333-4d94-a3a7-e31750f1c7c0]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d50a8c6-9ff8-4595-9759-dd41d13be71d]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6c18a41e-b8f5-4f38-b781-4ff511250fa1]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3df4532e-4db5-417b-ae8e-ba2f99cc0fe1]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f9ca35e5-cfce-439d-af86-38f3a174a57a]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=77d43cc5-ea2c-49a6-97e1-715bbb4ac96a]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8b5558f3-d961-448c-bd02-e20f90bf29c9]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b28ce93-0151-477d-a321-8bf773832abc]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a0db70e9-00ae-4821-888a-4f3d80a90510]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=16f5bb92-e699-4030-8a5a-284cf5754e3f]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5d23af95-22cf-420a-9758-002769345319]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6c62ca82-392c-41f3-b0fa-4975a264b91a]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4aa3e003-ecf2-4e87-98dd-f180febef935]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e3d48590-36ff-4ba6-a56e-05a3cbeb893b]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d75839ea-72d7-4ec0-8073-06a04f193db1]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=35cb7cbd-12aa-4c2b-942b-f27d8d077aac]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b18ab42a-38e1-4fac-906c-aab3837b4474]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6ffbfda3-a97e-4508-be8b-ed7c81da0c8b]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cffd951d-11ee-4ea2-9ca3-be115cd03218]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=31558a3d-378b-4367-8a7e-d4baf410fe75]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f813e328-48fd-47ed-9ba4-dd4f4740ece8]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ad61cc5e-3543-4c9c-b055-85881880867f]
module.keycloak_test.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203b654e-69af-46cb-b0e6-105c6f934a37]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b3fa1552-d8ff-4e32-8bc4-d73d66b5e5f2]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9ebc1b36-0da2-452b-b876-e4b1e4a048fe]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7205a5d1-c58c-454a-880c-00d8952d9571]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=75933f18-bca5-46cb-944b-1a17f6dc673f]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=becdc53d-0e9c-4b7c-b97c-09dd8c183ae2]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=33a4aac9-3342-4632-bd1a-36bcc8637b5a]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=567274d1-7d7e-4293-bf0e-50649b4d565c]
module.keycloak_test.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=813f7f60-e49e-4bf2-afab-06e80230307c]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9952a288-5969-4658-b0af-53ab439e1d84]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=30b2b203-890e-46f8-a820-cf9b639a1c78]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c4e3c2b9-828e-46be-a992-5f9356403f41]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96c27c55-edaa-43a0-94f7-dc559d307f71]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aa88f947-a5ad-4b2c-b21f-e31f577f450a]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=97ccc6a5-4dc6-43b2-a6b7-702503bb1ba2]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=080c8caa-8f60-4ad9-9e64-474c6846dc41]
module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=14f6864c-2893-4e5d-9d0a-ad9a258be083]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f7d8d4f4-8b87-4bec-b93a-dde43933fddb]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cbb2e91b-a778-4009-8bac-dfaa9167a26e]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=19712263-5b2a-438f-8724-2191b1a1fcd9]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f56c02fc-40b5-4b7e-9a8a-e3154eec75a1]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d4c6e68f-1a15-4f2e-a79d-be8d3bed6eac]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=df7401fe-fa01-48c5-a175-231f43b8158a]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=100dfeb7-32a5-417e-a708-3b0930945a72]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3169.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4469be6d-8923-45fd-b11b-a8d12348adac]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0cd7fc4a-e210-43bd-a610-ee655f762b5d]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e0776b81-e6a5-4946-9274-60a1f7a37b38]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ddf41877-1ec3-4f3a-9dc8-6c3bb355f53b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7772118c-8444-44c9-9c7f-511037d800f6]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=faf23fbd-e2c7-4bcf-84e2-1be6a29ebd8c]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5be50a8-a0a3-4f47-9e47-95db04b2d6bf]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7f4ae80c-53c3-4347-b191-6d1ffba9c519]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4969436c-370e-40e5-95e6-274a87fe85a6]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec12df76-4a72-4dcb-ba5f-f880f9fb67c7]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7ca2863d-f6b5-4c20-8661-1f18684c4144]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1ce9bb04-3df4-48e5-8eda-aacb1d6ddd91]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c4ea7d68-8ebe-41c7-a535-d7c7ece8c82b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9032a9a0-1dba-471d-80e9-bfee5b92c65f]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98597753-03f7-4918-9786-89ea80b519da]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1265110f-8849-4ddb-b384-b22e2770c401]
module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a37ff63-738e-4914-9067-f1b201cd6c85]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c63c5f6f-4350-4886-8d39-a14df306392f]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=27ef1561-68ed-4e26-8ef4-dac5d728820b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1076fe8f-5061-4831-9f25-fea801d81bf0]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9a0a937e-9d25-46df-87e2-d068f958ee7a]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=12977c21-4d9f-4354-b30b-27170906e250]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=361cf6c5-94db-4aa1-9a12-f0ad60588a27]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ca9e56d-c5e3-43e9-94e3-805faa432ce4]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=181b8c8d-8493-4d24-a934-325134dce5fe]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ac3656b-5da0-447d-9519-440afd8687af]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3a7ce87c-4b11-4ebb-a19d-2a24cb3e1ee6]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fe82c085-65b5-4720-832f-2c75a1cff0b3]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4193c24e-5ad0-450b-b023-1b9eedbb2f2d]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=25dfc71f-2263-428b-8516-909100cc565e]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f0003644-40d8-4c66-964b-44a467a515f7]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8425a818-1650-4368-81a7-252ff265865f]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2c56ada8-5485-4f24-bc80-e85e88c00fa1]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=79da43e5-49c8-47e1-97a6-77b95d261005]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=166a0a9b-7bed-4076-b9b0-9e6d8763d890]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0f62714a-5354-4b61-bb11-add0e9a44b81]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5d4b9e58-52a7-4d27-9e2c-67e74e4f4c89]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1c643ed-e3ef-4d86-83f6-58262266e7a9]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=62d76ddf-f5e3-4d82-be12-d31ef78a5a08]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c379eff-166d-47af-b4a8-336775f39c65]
module.keycloak_test.module.onestopauth_basic.module.client_bceidbasic-2-5414.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6435638c-5046-4b70-8a06-2e6c19fc9976]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c29c273e-4919-4ee1-a9c7-e94028642638]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ad14a42-adf0-4eb6-b87f-04478a1b85ba]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=771cf276-c9b5-42d8-ad89-11674cbabf0e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=af79bb43-7e01-4a26-9813-bd8eccce45ec]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1766753c-5bec-4425-b67b-99096816e02e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=919a2516-5484-44bf-ba5d-298b70c76a83]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c12bf377-f60c-4b79-b1ef-5828f1ab66f9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e38de05-06d5-436a-9de0-b320970d2c38]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-03-b-ce-id-basic-test-6205"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-03-b-ce-id-basic-test-6205"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-03-b-ce-id-basic-test-6205"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-03-b-ce-id-basic-test-6205"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-03-b-ce-id-basic-test-6205"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-03-b-ce-id-basic-test-6205"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-03-b-ce-id-basic-test-6205.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-03-b-ce-id-basic-test-6205"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-03-b-ce-id-basic-test-6205"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidTest.com",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3717 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*